rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_STCU.h
#define STCU_MBSSW0_MBSSW1_MASK                  (0x2U)
#define STCU_MBSSW0_MBSSW1_SHIFT                 (1U)
#define STCU_MBSSW0_MBSSW1_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW1(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW1_SHIFT)) & STCU_MBSSW0_MBSSW1_MASK)

#define STCU_MBSSW0_MBSSW2_MASK                  (0x4U)
#define STCU_MBSSW0_MBSSW2_SHIFT                 (2U)
#define STCU_MBSSW0_MBSSW2_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW2(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW2_SHIFT)) & STCU_MBSSW0_MBSSW2_MASK)

#define STCU_MBSSW0_MBSSW3_MASK                  (0x8U)
#define STCU_MBSSW0_MBSSW3_SHIFT                 (3U)
#define STCU_MBSSW0_MBSSW3_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW3(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW3_SHIFT)) & STCU_MBSSW0_MBSSW3_MASK)

#define STCU_MBSSW0_MBSSW4_MASK                  (0x10U)
#define STCU_MBSSW0_MBSSW4_SHIFT                 (4U)
#define STCU_MBSSW0_MBSSW4_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW4(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW4_SHIFT)) & STCU_MBSSW0_MBSSW4_MASK)

#define STCU_MBSSW0_MBSSW5_MASK                  (0x20U)
#define STCU_MBSSW0_MBSSW5_SHIFT                 (5U)
#define STCU_MBSSW0_MBSSW5_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW5(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW5_SHIFT)) & STCU_MBSSW0_MBSSW5_MASK)

#define STCU_MBSSW0_MBSSW6_MASK                  (0x40U)
#define STCU_MBSSW0_MBSSW6_SHIFT                 (6U)
#define STCU_MBSSW0_MBSSW6_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW6(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW6_SHIFT)) & STCU_MBSSW0_MBSSW6_MASK)

#define STCU_MBSSW0_MBSSW7_MASK                  (0x80U)
#define STCU_MBSSW0_MBSSW7_SHIFT                 (7U)
#define STCU_MBSSW0_MBSSW7_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW7(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW7_SHIFT)) & STCU_MBSSW0_MBSSW7_MASK)

#define STCU_MBSSW0_MBSSW8_MASK                  (0x100U)
#define STCU_MBSSW0_MBSSW8_SHIFT                 (8U)
#define STCU_MBSSW0_MBSSW8_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW8(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW8_SHIFT)) & STCU_MBSSW0_MBSSW8_MASK)

#define STCU_MBSSW0_MBSSW9_MASK                  (0x200U)
#define STCU_MBSSW0_MBSSW9_SHIFT                 (9U)
#define STCU_MBSSW0_MBSSW9_WIDTH                 (1U)
#define STCU_MBSSW0_MBSSW9(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW9_SHIFT)) & STCU_MBSSW0_MBSSW9_MASK)

#define STCU_MBSSW0_MBSSW10_MASK                 (0x400U)
#define STCU_MBSSW0_MBSSW10_SHIFT                (10U)
#define STCU_MBSSW0_MBSSW10_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW10(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW10_SHIFT)) & STCU_MBSSW0_MBSSW10_MASK)

#define STCU_MBSSW0_MBSSW11_MASK                 (0x800U)
#define STCU_MBSSW0_MBSSW11_SHIFT                (11U)
#define STCU_MBSSW0_MBSSW11_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW11(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW11_SHIFT)) & STCU_MBSSW0_MBSSW11_MASK)

#define STCU_MBSSW0_MBSSW12_MASK                 (0x1000U)
#define STCU_MBSSW0_MBSSW12_SHIFT                (12U)
#define STCU_MBSSW0_MBSSW12_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW12(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW12_SHIFT)) & STCU_MBSSW0_MBSSW12_MASK)

#define STCU_MBSSW0_MBSSW13_MASK                 (0x2000U)
#define STCU_MBSSW0_MBSSW13_SHIFT                (13U)
#define STCU_MBSSW0_MBSSW13_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW13(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW13_SHIFT)) & STCU_MBSSW0_MBSSW13_MASK)

#define STCU_MBSSW0_MBSSW14_MASK                 (0x4000U)
#define STCU_MBSSW0_MBSSW14_SHIFT                (14U)
#define STCU_MBSSW0_MBSSW14_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW14(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW14_SHIFT)) & STCU_MBSSW0_MBSSW14_MASK)

#define STCU_MBSSW0_MBSSW15_MASK                 (0x8000U)
#define STCU_MBSSW0_MBSSW15_SHIFT                (15U)
#define STCU_MBSSW0_MBSSW15_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW15(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW15_SHIFT)) & STCU_MBSSW0_MBSSW15_MASK)

#define STCU_MBSSW0_MBSSW16_MASK                 (0x10000U)
#define STCU_MBSSW0_MBSSW16_SHIFT                (16U)
#define STCU_MBSSW0_MBSSW16_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW16(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW16_SHIFT)) & STCU_MBSSW0_MBSSW16_MASK)

#define STCU_MBSSW0_MBSSW17_MASK                 (0x20000U)
#define STCU_MBSSW0_MBSSW17_SHIFT                (17U)
#define STCU_MBSSW0_MBSSW17_WIDTH                (1U)
#define STCU_MBSSW0_MBSSW17(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW17_SHIFT)) & STCU_MBSSW0_MBSSW17_MASK)
/*! @} */

/*! @name MBESW0 - STCU2 Online MBIST End Flag */
/*! @{ */

#define STCU_MBESW0_MBESW0_MASK                  (0x1U)
#define STCU_MBESW0_MBESW0_SHIFT                 (0U)
#define STCU_MBESW0_MBESW0_WIDTH                 (1U)
#define STCU_MBESW0_MBESW0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW0_SHIFT)) & STCU_MBESW0_MBESW0_MASK)

#define STCU_MBESW0_MBESW1_MASK                  (0x2U)
#define STCU_MBESW0_MBESW1_SHIFT                 (1U)
#define STCU_MBESW0_MBESW1_WIDTH                 (1U)
#define STCU_MBESW0_MBESW1(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW1_SHIFT)) & STCU_MBESW0_MBESW1_MASK)

#define STCU_MBESW0_MBESW2_MASK                  (0x4U)
#define STCU_MBESW0_MBESW2_SHIFT                 (2U)
#define STCU_MBESW0_MBESW2_WIDTH                 (1U)
#define STCU_MBESW0_MBESW2(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW2_SHIFT)) & STCU_MBESW0_MBESW2_MASK)

