rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_STCU.h
#define STCU_MBUFM0_MBUFM5_MASK                  (0x20U)
#define STCU_MBUFM0_MBUFM5_SHIFT                 (5U)
#define STCU_MBUFM0_MBUFM5_WIDTH                 (1U)
#define STCU_MBUFM0_MBUFM5(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM5_SHIFT)) & STCU_MBUFM0_MBUFM5_MASK)

#define STCU_MBUFM0_MBUFM6_MASK                  (0x40U)
#define STCU_MBUFM0_MBUFM6_SHIFT                 (6U)
#define STCU_MBUFM0_MBUFM6_WIDTH                 (1U)
#define STCU_MBUFM0_MBUFM6(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM6_SHIFT)) & STCU_MBUFM0_MBUFM6_MASK)

#define STCU_MBUFM0_MBUFM7_MASK                  (0x80U)
#define STCU_MBUFM0_MBUFM7_SHIFT                 (7U)
#define STCU_MBUFM0_MBUFM7_WIDTH                 (1U)
#define STCU_MBUFM0_MBUFM7(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM7_SHIFT)) & STCU_MBUFM0_MBUFM7_MASK)

#define STCU_MBUFM0_MBUFM8_MASK                  (0x100U)
#define STCU_MBUFM0_MBUFM8_SHIFT                 (8U)
#define STCU_MBUFM0_MBUFM8_WIDTH                 (1U)
#define STCU_MBUFM0_MBUFM8(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM8_SHIFT)) & STCU_MBUFM0_MBUFM8_MASK)

#define STCU_MBUFM0_MBUFM9_MASK                  (0x200U)
#define STCU_MBUFM0_MBUFM9_SHIFT                 (9U)
#define STCU_MBUFM0_MBUFM9_WIDTH                 (1U)
#define STCU_MBUFM0_MBUFM9(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM9_SHIFT)) & STCU_MBUFM0_MBUFM9_MASK)

#define STCU_MBUFM0_MBUFM10_MASK                 (0x400U)
#define STCU_MBUFM0_MBUFM10_SHIFT                (10U)
#define STCU_MBUFM0_MBUFM10_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM10(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM10_SHIFT)) & STCU_MBUFM0_MBUFM10_MASK)

#define STCU_MBUFM0_MBUFM11_MASK                 (0x800U)
#define STCU_MBUFM0_MBUFM11_SHIFT                (11U)
#define STCU_MBUFM0_MBUFM11_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM11(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM11_SHIFT)) & STCU_MBUFM0_MBUFM11_MASK)

#define STCU_MBUFM0_MBUFM12_MASK                 (0x1000U)
#define STCU_MBUFM0_MBUFM12_SHIFT                (12U)
#define STCU_MBUFM0_MBUFM12_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM12(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM12_SHIFT)) & STCU_MBUFM0_MBUFM12_MASK)

#define STCU_MBUFM0_MBUFM13_MASK                 (0x2000U)
#define STCU_MBUFM0_MBUFM13_SHIFT                (13U)
#define STCU_MBUFM0_MBUFM13_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM13(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM13_SHIFT)) & STCU_MBUFM0_MBUFM13_MASK)

#define STCU_MBUFM0_MBUFM14_MASK                 (0x4000U)
#define STCU_MBUFM0_MBUFM14_SHIFT                (14U)
#define STCU_MBUFM0_MBUFM14_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM14(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM14_SHIFT)) & STCU_MBUFM0_MBUFM14_MASK)

#define STCU_MBUFM0_MBUFM15_MASK                 (0x8000U)
#define STCU_MBUFM0_MBUFM15_SHIFT                (15U)
#define STCU_MBUFM0_MBUFM15_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM15(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM15_SHIFT)) & STCU_MBUFM0_MBUFM15_MASK)

#define STCU_MBUFM0_MBUFM16_MASK                 (0x10000U)
#define STCU_MBUFM0_MBUFM16_SHIFT                (16U)
#define STCU_MBUFM0_MBUFM16_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM16(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM16_SHIFT)) & STCU_MBUFM0_MBUFM16_MASK)

#define STCU_MBUFM0_MBUFM17_MASK                 (0x20000U)
#define STCU_MBUFM0_MBUFM17_SHIFT                (17U)
#define STCU_MBUFM0_MBUFM17_WIDTH                (1U)
#define STCU_MBUFM0_MBUFM17(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM17_SHIFT)) & STCU_MBUFM0_MBUFM17_MASK)
/*! @} */

/*! @name CTRL - STCU2 LBIST Control */
/*! @{ */

#define STCU_CTRL_CWS_MASK                       (0x3FU)
#define STCU_CTRL_CWS_SHIFT                      (0U)
#define STCU_CTRL_CWS_WIDTH                      (6U)
#define STCU_CTRL_CWS(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_CWS_SHIFT)) & STCU_CTRL_CWS_MASK)

#define STCU_CTRL_SCEN_ON_MASK                   (0xF00U)
#define STCU_CTRL_SCEN_ON_SHIFT                  (8U)
#define STCU_CTRL_SCEN_ON_WIDTH                  (4U)
#define STCU_CTRL_SCEN_ON(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SCEN_ON_SHIFT)) & STCU_CTRL_SCEN_ON_MASK)

#define STCU_CTRL_SCEN_OFF_MASK                  (0xF000U)
#define STCU_CTRL_SCEN_OFF_SHIFT                 (12U)
#define STCU_CTRL_SCEN_OFF_WIDTH                 (4U)
#define STCU_CTRL_SCEN_OFF(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SCEN_OFF_SHIFT)) & STCU_CTRL_SCEN_OFF_MASK)

#define STCU_CTRL_SHS_MASK                       (0x70000U)
#define STCU_CTRL_SHS_SHIFT                      (16U)
#define STCU_CTRL_SHS_WIDTH                      (3U)
#define STCU_CTRL_SHS(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SHS_SHIFT)) & STCU_CTRL_SHS_MASK)

#define STCU_CTRL_PTR_MASK                       (0x7FE00000U)
#define STCU_CTRL_PTR_SHIFT                      (21U)
#define STCU_CTRL_PTR_WIDTH                      (10U)
#define STCU_CTRL_PTR(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_PTR_SHIFT)) & STCU_CTRL_PTR_MASK)

#define STCU_CTRL_CSM_MASK                       (0x80000000U)
#define STCU_CTRL_CSM_SHIFT                      (31U)
#define STCU_CTRL_CSM_WIDTH                      (1U)
#define STCU_CTRL_CSM(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_CSM_SHIFT)) & STCU_CTRL_CSM_MASK)
/*! @} */

/*! @name PCS - STCU2 LBIST PC Stop */
/*! @{ */

#define STCU_PCS_PCS_MASK                        (0x3FFFFFFU)
#define STCU_PCS_PCS_SHIFT                       (0U)
#define STCU_PCS_PCS_WIDTH                       (26U)
#define STCU_PCS_PCS(x)                          (((uint32_t)(((uint32_t)(x)) << STCU_PCS_PCS_SHIFT)) & STCU_PCS_PCS_MASK)
/*! @} */

